## Exercise 1

In [1]:
import pandas as pd

df = pd.DataFrame({
    "hours_studied": [2, 4, 6, 8],
    "sleep_hours": [6, 7, 6, 8],
    "exam_score": [55, 65, 75, 90]
})
df

   hours_studied  sleep_hours  exam_score
0              2            6          55
1              4            7          65
2              6            6          75
3              8            8          90

In [2]:
#Task 1:
print("Features")
df.drop(columns= ["exam_score"])

Features

   hours_studied  sleep_hours
0              2            6
1              4            7
2              6            6
3              8            8

In [3]:
print("Labels")
df.drop(columns= ["hours_studied", "sleep_hours"])

Labels

   exam_score
0          55
1          65
2          75
3          90

In [4]:
#Task 2:
X= df.drop(columns= ["exam_score"])
print("", X.shape)

 (4, 2)

In [5]:
y= df["exam_score"]
print("", y.shape)

 (4,)

## Exercise 2

In [6]:
dff = pd.DataFrame({
    "age": [20, None, 22, None, 25],
    "marks": [80, 85, None, 90, 88]
})
dff

    age  marks
0  20.0   80.0
1   NaN   85.0
2  22.0    NaN
3   NaN   90.0
4  25.0   88.0

### Task 1:

Total 3 missing values are present

* 2 values are missing in age column

* 1 value missing in the marks column

In [7]:
#Task 2
dff.fillna(dff.median())

    age  marks
0  20.0   80.0
1  22.0   85.0
2  22.0   86.5
3  22.0   90.0
4  25.0   88.0

### Task 3
We can confirm no missing values are present

## Exercise 3

Which of the following are leakage? Why?

* Using final_exam_score to predict pass/fail- *Yes*, because knowing final_exam_score already lets us know if we passed or failed

* Using attendance_percentage to predict final_exam_score- *No*, not leakage because attendance data does not directly lead to output

* Filling missing values before train-test split- *Yes*, it does come under leakage

* Using customer_id as a feature- Not data leakage but useless to do so

## Exercise 4

In [8]:
df = pd.DataFrame({
    "age": [18, 19, 20, 21, 22, 23],
    "hours_online": [5, 7, 10, 12, 9, 8],
    "grades": [70, 75, 65, 60, 68, 72]
})

In [9]:
#Task 1
df.head()

   age  hours_online  grades
0   18             5      70
1   19             7      75
2   20            10      65
3   21            12      60
4   22             9      68

In [10]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 3 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   age           6 non-null      int64
 1   hours_online  6 non-null      int64
 2   grades        6 non-null      int64
dtypes: int64(3)
memory usage: 276.0 bytes

In [11]:
df.describe()

             age  hours_online     grades
count   6.000000      6.000000   6.000000
mean   20.500000      8.500000  68.333333
std     1.870829      2.428992   5.316641
min    18.000000      5.000000  60.000000
25%    19.250000      7.250000  65.750000
50%    20.500000      8.500000  69.000000
75%    21.750000      9.750000  71.500000
max    23.000000     12.000000  75.000000

In [12]:
#Task 2
X= df.drop(columns= ["grades"])
y= df["grades"]

### Task 3
* As hours online increase, grades seem to decrease.
* Younger students appear to score slightly better here.